//=============================================================================
//
// ファイル処理 [file.h]
// Author : GARCIA DANIEL
//
//=============================================================================
#pragma once

#include "main.h"
#include "modelBinaryFBX.h"
#include "player.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/



/*******************************************************************************
* 構造体定義
*******************************************************************************/
struct	P_DATA				// セーブデータの構造体
{
	XMFLOAT3		pos;		// モデルの位置
	XMFLOAT3		rot;		// モデルの向き(回転)

	int				HPmax;
	int				HPcur;
	int				agility;
	int				attack;
	int				deffense;
};


struct	SAVE_PLAYER_DATA				// セーブデータの構造体
{
	P_DATA playerData[MAX_PLAYER];

	int		sum;				// チェックサムを入れる
};

struct	SAVE_GAME_DATA				// セーブデータの構造体
{
	float VolumeBGM;			// BGM音量を保存する
	float VolumeSE;				// SE 音量を保存する

	int		sum;				// チェックサムを入れる
};


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void SaveDataPlayer(void);
void LoadDataPlayer(void);


