//=============================================================================
//
// BG処理 [bg.h]
// Author : GARCIA DANIEL
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"
#include "d3d11.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define BACKGROUNDS_MAX				(3)


//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct BG
{
	XMFLOAT3	pos;		// ポリゴンの座標
	float		w, h;		// 幅と高さ
	int			texNo;		// 使用しているテクスチャ番号

	float		scrl;		// スクロール

};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBG(void);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

BG* GetBG(void);		// シーンの大きさ構造体の先頭アドレスを取得
BG* GetBGmove(void);	//BG構造体の先頭アドレスを取得
